artillery/integration.test.yml
config:
  target: 'https://dogspot.site'
  phases:
    - duration: 60
      arrivalRate: 400
      name: 'Initial phase'


scenarios:
  - flow:
      - get:
          url: '/api/walksBoard'
          qs:
            page: 1
            size: 20
            order: DESC
          headers:
            Accept: 'application/json'

  - flow:
      - post:
          url: '/api/walksBoard'
          headers:
            Authorization: 'Bearer eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJ1c2VySWR4IjoxLCJPUyI6IndlYiIsImlhdCI6MTcyMjc1Njg0MSwiZXhwIjoxNzIyNzY0MDQxfQ.EAltcCIn55b3Eg_LOJ-ikNIWg6YZhH6tGS0EM7k8tpU'
          formData:
            maxParticipants: '8'
            places: 'Actual location on the map.'
            thumbnail: 'Thumbnail image.'
            userIdx: '1'
            location: 'Simple location.'
            meetingDatetime: '2023-06-13T00:00:00.000Z'
            title: 'Anyone for a walk at Borame Park this afternoon?'
            description: 'Details about the post.'